Reports/ЗадачиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Report>
		<Properties>
			<Name>ЗадачиПользователя</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыКПроведению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ДокументыКПроведению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>СтатусыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПрибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВКД_ДополнительныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ВКД_ДополнительныеЗатраты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ЗадачиПользователя/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// 1. Получаем текст макета
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// 2. Создаем таблицу для СКД
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Объект", 	ТипСсылка());
	ТаблицаДанных.Колонки.Добавить("Задача", 	Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	//ТаблицаДанных.Колонки.Добавить("Описание");
	
	ЗаполнитьТаблицуДанных(ТаблицаДанных);
	
	//// Алгоритм разбора строк (условно, если в макете разделитель "|")
	//Для НомерСтроки = 1 По СтрЧислоСтрок(МакетТекст) Цикл
	//    ТекСтрока = СтрПолучитьСтроку(МакетТекст, НомерСтроки);
	//    // Пример парсинга: Дата | Заказчик | Тэги | Описание
	//    Части = СтрРазделить(ТекСтрока, "|");
	//    Если Части.Количество() >= 4 Тогда
	//        НоваяСтрока = ТаблицаДанных.Добавить();
	//        НоваяСтрока.Дата     = Дата(СокрЛП(Части[0]));
	//        НоваяСтрока.Заказчик = СокрЛП(Части[1]);
	//        НоваяСтрока.Тэг      = СокрЛП(Части[2]); // Здесь тэги через запятую
	//        НоваяСтрока.Описание = СокрЛП(Части[3]);
	//    КонецЕсли;
	//КонецЦикла;

    // 3. Передаем таблицу в СКД
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ТипСсылка()
	
	// 1. Создаем пустой массив для хранения разрешенных типов
	МассивТипов = Новый Массив;
	
	// 2. Добавляем в массив нужные типы
	// Обязательно указываем конкретные виды документов и справочников
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ДвижениеДенег"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Перемещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка._Инвойс"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВКД_ДополнительныеЗатраты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	// 3. Создаем объект "ОписаниеТипов" на основе собранного массива
	Возврат Новый ОписаниеТипов(МассивТипов);	
	
КонецФункции // ()

Процедура ЗаполнитьТаблицуДанных(тз)

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	Запр.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	
	// 1.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ТЧТовары.Ссылка КАК Инвойс,
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Номенклатура.Вес КАК Вес
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ПривязкиИнвойсов.Инвойс
	             |			ИЗ
	             |				Документ.ДвижениеДенег.Инвойсы КАК ПривязкиИнвойсов
	             |			ГДЕ
	             |				ПривязкиИнвойсов.Ссылка.Проведен
	             |				И ПривязкиИнвойсов.Ссылка.Дата > ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -3))
	             |	И НЕ ТЧТовары.Ссылка.ПометкаУдаления
	             |	И ТЧТовары.Ссылка.Дата >= &ДатаНачала
	             |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |	И ТЧТовары.Номенклатура.Вес < 9";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Номенклатура"), "Заполнить вес номенклатуры", 1);
	ДобавитьСтрокиТаблицы(тз,  Выгрузка.ВыгрузитьКолонку("Инвойс"), "Перепровести инвойсы с товарами без веса", 2);

	// 2.  
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ ПриходнаяНакладная.Окончательно
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.ПриходнаяНакладная.Товары КАК ТЧТовары)";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить 'Окончательно'", 2);
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	РасходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	             |ГДЕ
	             |	РасходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ РасходнаяНакладная.Окончательно
	             |	И РасходнаяНакладная.Проведен
	             |	И РасходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.РасходнаяНакладная.Товары КАК ТЧТовары)";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 3);
	
	// 3.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.ВКД_Инвойс <> ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	             |	И ПриходнаяНакладная.Дата < ПриходнаяНакладная.ВКД_Инвойс.Дата
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Дата >= &ДатаНачала
	             |	И ПриходнаяНакладная.ВКД_Инвойс.Проведен";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Изменить дату накладной (дата раньше даты инвойса)", 5);
	
	//4.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ОприходНоменклатуры.Документ КАК Документ,
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.КоличествоОстаток КАК Количество,
	             |	ОприходНоменклатуры.СуммаЗакупкиОстаток КАК Сумма
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки КАК ОприходНоменклатуры
	             |ГДЕ
	             |	ОприходНоменклатуры.Документ.Дата >= &ДатаНачала
	             |	И ОприходНоменклатуры.Документ В
	             |			(ВЫБРАТЬ
	             |				СостоянияИнвойсов.Инвойс
	             |			ИЗ
	             |				РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |			ГДЕ
	             |				СостоянияИнвойсов.Инвойс.Дата >= &ДатаНачала
	             |				И СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл))"; 
	 Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	ДобавитьСтрокуТаблицы(тз, Выборка.Документ, СтрШаблон("Разница инвойс-накладные '%1': кол-во %2, сумма %3", 
																Выборка.Номенклатура, 
																Выборка.Количество, 
																Формат(Выборка.Сумма,"ЧДЦ=2")), 
																7);
	 КонецЦикла;
	 
	 // 5.  
	 
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	              |	ДвижениеДенегИнвойсы.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	              |ГДЕ
	              |	ДвижениеДенегИнвойсы.Инвойс = ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	              |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	              |	И ДвижениеДенегИнвойсы.Ссылка.Дата >= &ДатаНачала";
	 Выгрузка = Запр.Выполнить().Выгрузить();
	 ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "В привязках не указан ивойс", 5);

	 // 6.
	 
	 Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходнаяНакладная) И ПравоДоступа("Чтение", Метаданные.Документы.ВКД_ДополнительныеЗатраты) Тогда
		 
		 Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ  
		 			  // Шаг 1. Собираем все заявленные связи со стороны "ДопЗатрат"
		              |	ТЧ_Документы.Ссылка КАК ДопЗатраты,
		              |	ТЧ_Документы.Документ КАК ПриходнаяНакладная,
		              |	ТЧ_Документы.Документ.Проведен КАК ПН_Проведена
		              |ПОМЕСТИТЬ ВТ_ИзДопЗатрат
		              |ИЗ
		              |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ТЧ_Документы
		              |ГДЕ
		              |	ТЧ_Документы.Ссылка.Дата >= &ДатаНачала
		              |	И ТЧ_Документы.Ссылка.ПометкаУдаления = ЛОЖЬ
		              |	И ТЧ_Документы.Документ <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
		              |;
		              |  
					  // Шаг 2. Собираем все заявленные связи со стороны "Приходных накладных"
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ТЧ_Затраты.ДокументЗатрат КАК ДопЗатраты,
		              |	ТЧ_Затраты.Ссылка КАК ПриходнаяНакладная,
		              |	ТЧ_Затраты.ДокументЗатрат.Проведен КАК ДопЗатраты_Проведены
		              |ПОМЕСТИТЬ ВТ_ИзПриходных
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Затраты КАК ТЧ_Затраты
		              |ГДЕ
		              |	ТЧ_Затраты.Ссылка.Дата >= &ДатаНачала
		              |	И ТЧ_Затраты.Ссылка.ПометкаУдаления = ЛОЖЬ
		              |	И ТЧ_Затраты.ДокументЗатрат <> ЗНАЧЕНИЕ(Документ.ВКД_ДополнительныеЗатраты.ПустаяСсылка)
		              |;
		              |
					  |////////////////////////////////////////////////////////////////////////////////
					  // Шаг 3. Собираем итоговые данные по 4 условиям ТЗ
					  // Пункт 1: Непроведенные ПриходныеНакладные в ДопЗатратах
					  |ВЫБРАТЬ
					  | 1 КАК КодОшибки,
					  |	""Непроведенная ПрихНакладная указана в ДопЗатратах"" КАК ОписаниеПроблемы,
		              |	ВТ_ИзДопЗатрат.ПриходнаяНакладная КАК ПриходнаяНакладная,
		              |	ВТ_ИзДопЗатрат.ДопЗатраты КАК ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |ГДЕ
		              |	ВТ_ИзДопЗатрат.ПН_Проведена = ЛОЖЬ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
					  // Пункт 2: Непроведенные ДопЗатраты в ПриходныхНакладных
					  |
		              |ВЫБРАТЬ
					  | 2,
		              |	""Непроведенные ДопЗатраты указаны в ПрихНакладной"",
		              |	ВТ_ИзПриходных.ПриходнаяНакладная,
		              |	ВТ_ИзПриходных.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |ГДЕ
		              |	ВТ_ИзПриходных.ДопЗатраты_Проведены = ЛОЖЬ
		              |
		              |ОБЪЕДИНИТЬ ВСЕ 
					  // Пункт 3: ПН есть в ДопЗатратах, но в самой ПН нет этих ДопЗатрат (Односторонняя связь)
		              |
		              |ВЫБРАТЬ 
					  | 3,
		              |	""ПрихНакладная есть в док-те ДопЗатраты, но сам док-т ДопЗатрат не указан в ПрихНакладной"",
		              |	ВТ_ИзДопЗатрат.ПриходнаяНакладная,
		              |	ВТ_ИзДопЗатрат.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |		ПО ВТ_ИзДопЗатрат.ДопЗатраты = ВТ_ИзПриходных.ДопЗатраты
		              |			И ВТ_ИзДопЗатрат.ПриходнаяНакладная = ВТ_ИзПриходных.ПриходнаяНакладная
		              |ГДЕ
		              |	ВТ_ИзПриходных.ДопЗатраты ЕСТЬ NULL
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
					  // Пункт 4: ДопЗатраты есть в ПН, но в самих ДопЗатратах нет этой ПН (Односторонняя связь)
		              |
		              |ВЫБРАТЬ 
					  | 4,
		              |	""ДопЗатраты есть в ПрихНакладной, но сама ПрихНакладная не указана в ДопЗатратах"",
		              |	ВТ_ИзПриходных.ПриходнаяНакладная,
		              |	ВТ_ИзПриходных.ДопЗатраты
		              |ИЗ
		              |	ВТ_ИзПриходных КАК ВТ_ИзПриходных
		              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзДопЗатрат КАК ВТ_ИзДопЗатрат
		              |		ПО ВТ_ИзПриходных.ДопЗатраты = ВТ_ИзДопЗатрат.ДопЗатраты
		              |			И ВТ_ИзПриходных.ПриходнаяНакладная = ВТ_ИзДопЗатрат.ПриходнаяНакладная
		              |ГДЕ
		              |	ВТ_ИзДопЗатрат.ДопЗатраты ЕСТЬ NULL
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	ОписаниеПроблемы,
		              |	ПриходнаяНакладная,
		              |	ДопЗатраты";
		 Выборка = Запр.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл   
			 Если Выборка.КодОшибки = 1 Тогда
			 	ОбъектСсылка = Выборка.ДопЗатраты;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ПриходнаяНакладная;
			 ИначеЕсли Выборка.КодОшибки = 2 Тогда
			 	ОбъектСсылка = Выборка.ПриходнаяНакладная;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ДопЗатраты;
			 ИначеЕсли Выборка.КодОшибки = 3 Тогда
			 	ОбъектСсылка = Выборка.ДопЗатраты;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ПриходнаяНакладная;
             Иначе
			 	ОбъектСсылка = Выборка.ПриходнаяНакладная;
			 	Задача = Выборка.ОписаниеПроблемы + ": " + Выборка.ДопЗатраты;
			 КонецЕсли;
	    	 ДобавитьСтрокуТаблицы(тз, ОбъектСсылка, Задача, 9);
		 КонецЦикла;
		 
	 КонецЕсли; 
	 
	 // 7.
	 
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	ТоварныеДокументыОтправокПеремещений.Количество КАК Количество,
		             |	ТоварныеДокументыОтправокПеремещений.Сумма КАК Сумма,
		             |	ТоварныеДокументыОтправокПеремещений.ТоварныйДокумент КАК ТоварныйДокумент
		             |ИЗ
		             |	Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ОтправкаПеремещенийТЧ
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |			СУММА(ПеремещениеТовары.Количество) КАК Количество,
		             |			СУММА(ПеремещениеТовары.СуммаЗакупки) КАК Сумма,
		             |			ПеремещениеТовары.Ссылка КАК ТоварныйДокумент
		             |		ИЗ
		             |			Документ.Перемещение.Товары КАК ПеремещениеТовары
		             |		ГДЕ
		             |			ПеремещениеТовары.Ссылка В
		             |					(ВЫБРАТЬ
		             |						ТЧ.ТоварныйДокумент
		             |					ИЗ
		             |						Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |					ГДЕ
		             |						ТЧ.Ссылка.Проведен
		             |						И ТЧ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			ПеремещениеТовары.Ссылка
		             |		
		             |		ОБЪЕДИНИТЬ
		             |		
		             |		ВЫБРАТЬ
		             |			СУММА(РасходнаяТовары.Количество),
		             |			СУММА(РасходнаяТовары.СуммаЗакупки),
		             |			РасходнаяТовары.Ссылка
		             |		ИЗ
		             |			Документ.РасходнаяНакладная.Товары КАК РасходнаяТовары
		             |		ГДЕ
		             |			РасходнаяТовары.Ссылка В
		             |					(ВЫБРАТЬ
		             |						ТЧ.ТоварныйДокумент
		             |					ИЗ
		             |						Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |					ГДЕ
		             |						ТЧ.Ссылка.Проведен
		             |						И ТЧ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			РасходнаяТовары.Ссылка) КАК ТоварныеДокументыОтправокПеремещений
		             |		ПО ОтправкаПеремещенийТЧ.ТоварныйДокумент = ТоварныеДокументыОтправокПеремещений.ТоварныйДокумент";
		
		// 8.
		
		Если ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ВКД_ОприходованиеНоменклатуры) Тогда
			
			Запр.Текст = "// Шаг 0. Ищем целевые инвойсы.
					|// Получаем список Инвойсов, на основании к-рых есть хотя бы одна проведенная Прих.накладная с датой позже &ДатаНачала
					|ВЫБРАТЬ РАЗЛИЧНЫЕ 
					|	ПН.ВКД_Инвойс КАК Инвойс
					|ПОМЕСТИТЬ ВТ_ЦелевыеИнвойсы
					|ИЗ
					|	Документ.ПриходнаяНакладная КАК ПН
					|ГДЕ
					|	ПН.Дата >= &ДатаНачала
					|	И ПН.Проведен // Обязательное условие, чтобы не учитывать черновики
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|// Шаг 1. Собираем статистику по поставкам.
					|// Используем внутреннее соединение с целевыми инвойсами (Шаг 0).
					|ВЫБРАТЬ
					|	Обороты.Документ КАК Инвойс,
					|	Обороты.Поставка КАК Поставка,
					|	МАКСИМУМ(ВЫБОР КОГДА Обороты.КоличествоПриход > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЗаявленоВИнвойсе,
					|	МАКСИМУМ(ВЫБОР КОГДА Обороты.КоличествоРасход > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЕстьВНакладной
					|ПОМЕСТИТЬ ВТ_СтатусыПоставок
					|ИЗ
					|	ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Обороты КАК Обороты
					|		ПО ЦелевыеИнвойсы.Инвойс = Обороты.Документ
					|		
					|СГРУППИРОВАТЬ ПО
					|	Обороты.Документ,
					|	Обороты.Поставка
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|// Шаг 2. Отбираем только те Инвойсы, где ВСЕ заявленные поставки имеют накладные (Пункт 1).
					|ВЫБРАТЬ
					|	ВТ_СтатусыПоставок.Инвойс КАК Инвойс
					|ПОМЕСТИТЬ ВТ_ИнвойсыСПолнымНаборомНакладных
					|ИЗ
					|	ВТ_СтатусыПоставок КАК ВТ_СтатусыПоставок
					|СГРУППИРОВАТЬ ПО
					|	ВТ_СтатусыПоставок.Инвойс
					|ИМЕЮЩИЕ
					|	// Исключаем инвойсы, в которых есть поставка, заявленная в инвойсе (1), но по к-рой нет ни одной накладной (0).
					|	МАКСИМУМ(ВЫБОР КОГДА ВТ_СтатусыПоставок.ЗаявленоВИнвойсе = 1 И ВТ_СтатусыПоставок.ЕстьВНакладной = 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) = 0
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|// Шаг 3. Сворачиваем обороты по Номенклатуре и Поставке.
					|// Также соединяем только с нужными инвойсами, чтобы не тянуть из базы лишние данные.
					|ВЫБРАТЬ
					|	Обороты.Документ КАК Инвойс,
					|	Обороты.Поставка КАК Поставка,
					|	Обороты.Номенклатура КАК Номенклатура,
					|	СУММА(Обороты.КоличествоПриход) КАК КоличествоИнвойс,
					|	СУММА(Обороты.КоличествоРасход) КАК КоличествоНакладная
					|ПОМЕСТИТЬ ВТ_ОборотыНоменклатуры
					|ИЗ
					|	ВТ_ЦелевыеИнвойсы КАК ЦелевыеИнвойсы
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Обороты КАК Обороты
					|		ПО ЦелевыеИнвойсы.Инвойс = Обороты.Документ
					|СГРУППИРОВАТЬ ПО
					|	Обороты.Документ,
					|	Обороты.Поставка,
					|	Обороты.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|// Шаг 4. Итоговая выборка с применением логических условий.
					|ВЫБРАТЬ
					|	ВТ_ОборотыНоменклатуры.Инвойс КАК Инвойс,
					|	ВТ_ОборотыНоменклатуры.Поставка КАК Поставка, 
					|	ВТ_ОборотыНоменклатуры.Номенклатура КАК Номенклатура,
					|	// Выводим разницу: положительное число - излишек (в накладной больше), отрицательное - недостача.
					|	ВТ_ОборотыНоменклатуры.КоличествоНакладная - ВТ_ОборотыНоменклатуры.КоличествоИнвойс КАК Количество
					|ИЗ
					|	ВТ_ОборотыНоменклатуры КАК ВТ_ОборотыНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвойсыСПолнымНаборомНакладных КАК ВТ_ПолныеИнвойсы
					|		ПО ВТ_ОборотыНоменклатуры.Инвойс = ВТ_ПолныеИнвойсы.Инвойс
					|ГДЕ
					|	(
					|		// Пункт 3: Выводим излишки (в инвойсе 0, а в накладной > 0).
					|		// Работает ВСЕГДА, вне зависимости от того, все ли поставки приехали.
					|		ВТ_ОборотыНоменклатуры.КоличествоИнвойс = 0 
					|		И ВТ_ОборотыНоменклатуры.КоличествоНакладная > 0
					|	)
					|	ИЛИ
					|	(
					|		// Пункты 1 и 2: Инвойс прошел проверку на полноту поставок И есть расхождения в количестве.
					|		ВТ_ПолныеИнвойсы.Инвойс ЕСТЬ НЕ NULL
					|		И ВТ_ОборотыНоменклатуры.КоличествоИнвойс <> ВТ_ОборотыНоменклатуры.КоличествоНакладная
					|	)";
			Выборка = Запр.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДобавитьСтрокуТаблицы(тз, Выборка.Инвойс, 
										СтрШаблон("Разница между инвойсом и приходом %1%2: %3 шт.", 
											Выборка.Номенклатура,
											?(Выборка.ПОставка=0,""," (поставка "+Выборка.Поставка+")"),
											Выборка.Количество),
										8);
			КонецЦикла;
		
		КонецЕсли;
		
		// 100. 
		
		Запр.УстановитьПараметр("ДатаТекущая", ТекущаяДатаСеанса());
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	ДокументыКПроведению.Документ КАК Документ,
		             |	ДокументыКПроведению.Инициатор КАК Инициатор
		             |ИЗ
		             |	РегистрСведений.ДокументыКПроведению КАК ДокументыКПроведению
		             |ГДЕ
		             |	ДокументыКПроведению.Зарегистрировано < ДОБАВИТЬКДАТЕ(&ДатаТекущая, ДЕНЬ, -1)";	
		Выгрузка = Запр.Выполнить().Выгрузить();
		ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Не удается автоматически перепровести", 100);

		
КонецПроцедуры

Процедура ДобавитьСтрокиТаблицы(тз, МассивОбъектов, Задача, Приоритет)
	
	Для каждого Эл Из МассивОбъектов Цикл  
		ДобавитьСтрокуТаблицы(тз, Эл, Задача, Приоритет)
	КонецЦикла;

КонецПроцедуры 

Процедура ДобавитьСтрокуТаблицы(тз, Объект, Задача, Приоритет)
	
	НайдСтроки = тз.НайтиСтроки(Новый Структура("Объект", Объект));
	Если НайдСтроки.Количество() = 0 Тогда
		СтрокаТЗ = тз.Добавить();
	Иначе	
		СтрокаТЗ = НайдСтроки[0];
		Если Найти(СтрокаТЗ.Задача, Задача) > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СтрокаТЗ.Объект	= Объект;  
	Если ЗначениеЗаполнено(СтрокаТЗ.Задача) Тогда
		СтрокаТЗ.Задача = СтрокаТЗ.Задача + ";" + Символы.ПС;
	КонецЕсли;
	СтрокаТЗ.Задача	= "" + СтрокаТЗ.Задача + Задача;
	СтрокаТЗ.Приоритет	= Приоритет;
	
КонецПроцедуры
